# ========================
# 📦 Виртуальное окружение
# ========================
.venv/
.venv/*

# =====================
# 🐍 Кэш и метафайлы
# =====================
__pycache__/
*.py[cod]
*.pyo

# ========================
# 📊 Временные Excel-файлы
# ========================
~$*.xls*
*.bak
*.tmp

# ===========================
# 📥 Входные и рабочие данные
# ===========================
Data_in/
Data_work/
*.json

# =====================
# 💻 IDE и редакторы
# =====================
.idea/
*.code-workspace

# =========================
# 📝 Файлы логов и отладка
# =========================
*.log
*.err

# ========================
# 🔧 Конфигурации Windows
# ========================
Thumbs.db
desktop.ini
